app/controllers/rsvps_controller.rb

SELECT "rsvps".* FROM "rsvps"
---
  def index
    @rsvps = Rsvp.all

INSERT INTO "rsvps" ("name", "contact_number", "attending", "number_of_guests", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "aaa bbb"], ["contact_number", "0834200117"], ["attending", "t"], ["number_of_guests", 2], ["created_at", "2017-08-10 09:16:52.787936"], ["updated_at", "2017-08-10 09:16:52.787936"]]
---
  def create
    @rsvp = Rsvp.new(rsvp_params)

    respond_to do |format|
      if @rsvp.save

SELECT  "rsvps".* FROM "rsvps" WHERE "rsvps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_rsvp
      @rsvp = Rsvp.find(params[:id])